Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/court_offices/high_court_office.html.txt.tmx
Source language: en
Languages: ga

source: Office of the High Court - the Central Office
ga: Oifig na hArd Chúirte - an Oifig Lárnach

source: • provides administrative support to the judges and to the Master of the High Court
ga: • Cuireann tacaíocht riaracháin ar fáil do na Breithimh agus do Mháistir na hArd Chúirte

source: • processes family and civil law proceedings from initiation to completion
ga: • Réitíonn an próiseas ó thus go deireadh d'imeachtaí dlí clainne agus imeachtaí dlí shiabhalta

source: • issues orders of the High Court and the Supreme Court
ga: • Cuireann amach ordaithe ón Ardchúirt agus ón gCúirt Uachtarach

source: • circulates written judgements delivered by judges of the High Court
ga: • Scaipeann breithiúnais scríofa ó Bhreithimh san Ardchúirt

source: • deals with the registration of judgements of the High Court, Circuit Court and District Court,
ga: • Déanann clárú ar bhreithiúnais na mbreitheamh ón Ardchúirt, ón gCúirt Chuarda agus ón gCúirt Dúiche,

source: • issues execution orders, orders for committal and orders for possession,
ga: • Eisíonn ordaithe forghníomhaithe, ordaithe cimithe agus ordaithe seilbhe,

source: • deals with the enrollment of certain legal instruments including deeds poll (whereby a person can change his/her name), powers of attorney and bills of sale
ga: • Déanann clárú ar ghnéithe áirithe sa dlí mar shampla gníomhais aonpháirtí ( an bealach gur féidir le duine a ainm/a hainm a athrú), cumhacht aturnae agus billí díolacháin

source: • issues subpoenas to compel witnesses to attend at trial
ga: • Eisíonn subpoena chun iallach a chur ar fhinné freastal ar thriail

source: • employs Court Registrars to prepare and manage court lists, sit in court with the judge and draw up the formal orders made by the court
ga: • Fostaíonn Cláraitheoirí Cúirte a ullmhaíonn agus a dhéanann bainistiú ar ghnóthaí na Cuirte, a shuíonn sa chúirt leis an mBreitheamh agus a leagan amach na hordaithe foirmiúla a thugann an chúirt

source: Further information is available from the Central Office of the High Court
ga: Tá tuilleadh eolais ar Príomh-Oifig na hArd-Chúirte
